# Assignment 4

### 1. Read the housingdata.csv file into pandas DataFrame and display first six rows of the DataFrame

In [1]:
#Importing necessary libraries
import pandas as pd
import numpy as np

In [2]:
df = pd.read_csv('housingdata.csv')
print("The first six rows of the Data Frame:-")
df.head(6)

The first six rows of the Data Frame:-

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
2  100003000.0           AP    2541654          NaN        1   850
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
5  100006000.0           TN   65465466          NaN        1   800

### 2. Display the column names and row index in separate cells

In [3]:
#Displaying the column names
print("The column names are:-")
print(list(df.columns))

The column names are:-
['PID', 'STATE', 'PRICE', 'NUM_BEDROOMS', 'NUM_BATH', 'SQ_FT']

In [4]:
#Displaying the row index
print("The row index is:-")
print(list(df.index))

The row index is:-
[0, 1, 2, 3, 4, 5, 6, 7, 8]

### 3.
#### a. How many numbers of “STATE” exist in the dataset.

In [5]:
## Counting numbers of 'STATE' in the dataset
print(f"There are {df.shape[0]} numbers of STATE in the dataset")

There are 9 numbers of STATE in the dataset

#### b. How many unique states exist in the dataset.

In [6]:
print(f"There are {df['STATE'].nunique()} unique states in the dataset.")

There are 6 unique states in the dataset.

### 4. Retrieve the list of all NaN/Null/Empty cells in the form of Boolean list.

In [7]:
# Getting the required values
nan_bool_df = df.isna()
# Getting a boolean list
nan_bool_list = nan_bool_df.values.flatten().tolist()
#Displaying the boolean list
print(nan_bool_list)

[False, False, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, True, False, True, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False, False, False, False, False, False, False, False, True, False, False, False, False, False, False]

### 5. Drop all rows with N/A,NA,na values in Num_Bedrooms.

In [8]:
#Replacing na with NaN
df['NUM_BEDROOMS'] = df['NUM_BEDROOMS'].replace('na', np.nan)

#Dropping the rows with NaN values in NUM_BEDROOMS column
df = df.dropna(subset=['NUM_BEDROOMS'])

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS NUM_BATH SQ_FT
0  100001000.0           MP     321654            3        1  1000
1  100002000.0  MAHARASHTRA      21325            3      1.5    --
3  100004000.0           TN     321321            1      NaN   700
4          NaN           TN  589465645            3        2  1600
6  100007000.0        ASSAM    3222321            2   HURLEY   950
7  100008000.0           HP      23131            1        1   NaN

### 6. Replace the NaN and String entries in Num_Bath with previous entry.

In [9]:
#Suppressing SettingWithCopy Warning
pd.set_option('mode.chained_assignment', None)

#Replacing non numeric entries with NaN
df['NUM_BATH'] = pd.to_numeric(df['NUM_BATH'], errors='coerce')

#Performing forward fill
df['NUM_BATH'] = df['NUM_BATH'].fillna(method='ffill')

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH SQ_FT
0  100001000.0           MP     321654            3       1.0  1000
1  100002000.0  MAHARASHTRA      21325            3       1.5    --
3  100004000.0           TN     321321            1       1.5   700
4          NaN           TN  589465645            3       2.0  1600
6  100007000.0        ASSAM    3222321            2       2.0   950
7  100008000.0           HP      23131            1       1.0   NaN

### 7. Replace the empty values in “SQ_FT” with the mean of the all entries.

In [10]:
#Replacing non numeric entries with NaN
df['SQ_FT'] = pd.to_numeric(df['SQ_FT'], errors='coerce')

#Filling null values with mean
df['SQ_FT'] = df['SQ_FT'].fillna(df['SQ_FT'].mean())

#Displaying the Dataframe
df

           PID        STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT
0  100001000.0           MP     321654            3       1.0  1000.0
1  100002000.0  MAHARASHTRA      21325            3       1.5  1062.5
3  100004000.0           TN     321321            1       1.5   700.0
4          NaN           TN  589465645            3       2.0  1600.0
6  100007000.0        ASSAM    3222321            2       2.0   950.0
7  100008000.0           HP      23131            1       1.0  1062.5

### 8. What is the sum of SQ_FT of all entries in the dataset?

In [11]:
print(f"The sum of the SQ_FT of all entries in the dataset is {df['SQ_FT'].sum()} sq-ft.")

The sum of the SQ_FT of all entries in the dataset is 6375.0 sq-ft.

### 9. Add a new column “NUM_STORE” and with all the values as 1 for all rows.

In [12]:
#Adding column NUM_STORE with values 1
df['NUM_STORE'] = 1

#Displaying the Dataframe
df

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
0,100001000.0,MP,321654,3,1.0,1000.0,1
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
3,100004000.0,TN,321321,1,1.5,700.0,1
4,NaN,TN,589465645,3,2.0,1600.0,1
6,100007000.0,ASSAM,3222321,2,2.0,950.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

### 10. Create a DataFrame containing all entries of TN state only.

In [13]:
#Creating a mask
tn_mask = df['STATE'] == 'TN'

#Applying the mask to create a new Dataframe df_tn
df_tn = df[tn_mask]

#Displaying the Dataframe
df_tn

           PID STATE      PRICE NUM_BEDROOMS  NUM_BATH   SQ_FT  NUM_STORE
3  100004000.0    TN     321321            1       1.5   700.0          1
4          NaN    TN  589465645            3       2.0  1600.0          1

### 11. Create a DataFrame having SQ_FT area greater than 1000 and display the DataFrame.

In [14]:
#Creating a mask
sq_ft_mask = df['SQ_FT'] > 1000

#Applying the mask to create a new Dataframe df_sq_ft
df_sq_ft = df[sq_ft_mask]

#Displaying the Dataframe
df_sq_ft

,PID,STATE,PRICE,NUM_BEDROOMS,NUM_BATH,SQ_FT,NUM_STORE
1,100002000.0,MAHARASHTRA,21325,3,1.5,1062.5,1
4,NaN,TN,589465645,3,2.0,1600.0,1
7,100008000.0,HP,23131,1,1.0,1062.5,1

### 12. Create a DataFrame having only first Three columns and First Three rows.

In [15]:
#Creating dataframe having only first three rows and three columns
df_3_3 = df.iloc[:3, :3]

#Displaying the Dataframe
df_3_3

           PID        STATE   PRICE
0  100001000.0           MP  321654
1  100002000.0  MAHARASHTRA   21325
3  100004000.0           TN  321321

### 13. Display the state having highest average price per square foot of housing area. Hint: Average of(TotalPrice/Sq_Ft).

In [16]:
#Calculating Total Price per Sq Ft
df['PRICE_PER_SQ_FT'] = df['PRICE']/df['SQ_FT']

#Finding Average of Price Per Sq-Ft grouped by STATE and sorting in descending order
state_avg_price_per_sq_ft = df.groupby('STATE')['PRICE_PER_SQ_FT'].mean().sort_values(ascending=False)

#Displaying the state having highest average price per square foot of housing area
print(f"The state having highest average price per square foot of housing area is {list(state_avg_price_per_sq_ft.index)[0]}.")

The state having highest average price per square foot of housing area is TN.